//判断真假话问题
//将一个实际的问题归纳为纯数学问题
//将真设为1
//将假设为0
//相加得到共有几个真假
//从而得到正确条件
#include<stdio.h>
int main() {
	int a = 0;
	int b = 0;
	int c = 0;
	int d = 0;
	int e = 0;
	for ( a = 1; a <= 5; a++)
	{
		for (b = 1; b <= 5; b++)
		{
			for (c = 1; c <= 5; c++)
			{
				for (d = 1; d <= 5; d++)
				{
					for (e = 1; e <= 5; e++)
					{
						if (
							//判断条件
							(((b == 2) + (a == 3)) == 1) &&
							(((b == 2) + (e == 4)) == 1) &&
							(((c == 1) + (d == 2)) == 1) &&
							(((c == 5) + (d == 3)) == 1) &&
							(((e == 4) + (a == 1)) == 1)
							)
						{
							if (a*b*c*d*e == 1*2*3*4*5)
							//去重
							{
								printf("a = %d\nb = %d\nc = %d\nd = %d\ne = %d ", a, b, c, d, e);
								printf("\n");
								//return 0;
							}

							
						}
					}
				}
			}
		}
	}
	return 0;
}