#include<stdio.h>
int main()
{
	char a = -5;
	//(int)-5(补码) = 1111111 1111111 1111111 11111011 
   //(char)a(补码)  = 11111011 
	char b = -126;   // 
	//(int)-126(补码) = 11111111 11111111 11111111 10000010
	 //(char)b(补码)  = 10000010
	char c = a + b;
	//a + b 
	//有符号数按符号位补高位
	//a(补码) -> 整形提升 -> 11111111 11111111 11111111 11111011
	//b(补码) -> 整形提升 -> 11111111 11111111 11111111 10000010
	//                        
	//现将char类型字节转为int类型
	//扩大为4字节后,再运算
	//a+b(补码运算) =(1超过32bit位舍去) 11111111 11111111 11111111 01111101
	//运算后转化为原数据类型
	//c(补码) = 01111101
	//c(反码) = 01111101(补码是正数,所以反码,补码,原码相同) 
	//c(原码) = 01111101
	
	printf("%d\n", c);
	//打印一个整形c发生整形提升
	//(int)c(补码) -> 整形提升 -> 00000000 00000000 00000000 01111101
	//(int)c(反码) = 00000000 00000000 00000000 01111101
	//(int)c(原码) = 00000000 00000000 00000000 01111101  = 125 
	//打印 125
	return 0;
}