#include<stdio.h>
int main()
{
	char a = 5;
	  //(int)5 = 00000000 00000000 00000000 00000101
	 //(char)a = 00000101
	char b = 126;
	//(int)126 = 00000000 00000000 00000000 01111110
	 //(char)b = 01111110
	char c = a + b;
	//a + b 
	//有符号数按符号位补高位
	//a(补码) -> 整形提升 -> 00000000 00000000 00000000 00000101
	//b(补码) -> 整形提升 -> 00000000 00000000 00000000 01111110
	//现将char类型字节转为int类型
	//扩大为4字节后,再运算
	//a+b(补码运算) = 00000000 00000000 00000000 10000011
	//运算后转化为原数据类型
	//c(补码) = 10000011
	//c(反码) = 10000010 
	//c(原码) = 11111101
	printf("%d\n", a);
	printf("%d\n", b);
	printf("%d\n", c);
	//打印一个整形c发生整形提升
	//(int)c(补码) -> 整形提升 ->11111111 11111111 11111111 10000011
	//(int)c(反码) = 11111111 11111111 11111111 10000010
	//(int)c(原码) = 10000000 00000000 00000000 01111101  = -125 
	//打印 -125
	return 0;
}