#include<stdio.h>
//// 例题一
//int main() {
//	int a[] = { 1,2,3,4,5 };
//	int* ptr = (int*)(&a + 1);
//	printf("%d,%d", *(a + 1), *(ptr - 1));
//	return 0;
//}
// ///////////////////////////////////////////////
////例题2
//// 由于还没学结构体,这里告知结构体是20个字节
//struct Test
//{
//	int Num;
//	char* pcName;
//	short sDate;
//	char cha[2];
//	short sBa[4];
//}*p = (struct Test*)0x10000;
////假设p 的值为0x100000.如下表达式得知分别是多少
//int main() {
//	printf("%p\n",p+0x1);
//	printf("%p\n",(unsigned long)p + 0x1);
//	printf("%p\n",(unsigned int*)p + 0x1);
//
//	return 0;
//}
// ///////////////////////////////////////////////
////例题3
//int main() {
//	int a[4] = { 1,2,3,4 };
//	int* ptr1 = (int*)(&a + 1);
//	unsigned int* ptr2 = (unsigned int*)((int)a + 1);
//	printf("%x,%x", ptr1[-1], *ptr2);
//	return 0;
//}
// ///////////////////////////////////////////////
//例题4
//int main() {
//	int a[3][2] = { (0,1),(2,3),(4,5) };
//	int* p;
//	p = a[0];
//	printf("%d", p[2]);
//	return 0;
//}
// ///////////////////////////////////////////////
//例题5
//int main() {
//	int a[5][5];
//	int(*p)[4];
////a
//// 1 2 3 4 5
//// 1 2 3 4 5
//// 1 2 3 4 5
//// 1 2 3 4 5
//// 1 2  3  4 5
//// 
////p
//// 1 2 3 4
//// 5 1 2 3
//// 4 5 1 2
//// 3 4 5 1   
//// 2 3  4  5 
//// 1 2  3  4 
//// 5
//	p = a;
//	printf("%p,%d\n", &p[4][2] - &a[4][2], &p[4][2]-&a[4][2]);
//	// 2  8
//	return 0;
//}
// ///////////////////////////////////////////////
//例题六
//int main() {
//	int aa[2][5] = { 1,2,3,4,5,6,7,8,9,10 };
//// 1 2
//// 3 4
//// 5 6
//// 7 8
//// 9 10
//// 1p x
//// x x
//// x x
//// x x
//	int* ptr1 = (int*)(&aa + 1);
//	//随机值
//	int* ptr2 = (int*)(*(aa + 1));
//	//2
//	printf("%d,%d", *(ptr1 - 1), *(ptr2 - 1));
//	// 随机值 6
//	//
//	return 0;
//}
// /////////以上是错误的!!!!
//int main() {
//	int aa[2][5] = { 1,2,3,4,5,6,7,8,9,10 };
//	int* ptr1 = (int*)(&aa + 1);
//	int* ptr2 = (int*)(*(aa + 1));
//	printf("%d,%d", *(ptr1 - 1), *(ptr2 - 1));
//	return 0;
//}
// ///////////////////////////////////////////////
//例题七
// //个人理解
//int main() {
//	char* a[] = { "work","at","alibaba" };
//	// a为char*数组,存放char*类型变量
//	// // 应该是存放每个字符串的第一个字符的地址
//	// // 由于字符串是常量
//	// // 所以每个相同字符的地址相同
//	// // 以上解释不正确
//	// 所以a存放
//	// 'w','第一个a','第二个a'的地址
//	//
//	char** pa = a;
//	// pa为二级指针
//	// 此处的a表示首元素的地址
//	// pa存放a的地址
//	// *pa表示a的地址
//	// **pa表示a
//	//
//	pa++;
//	//+1个二级指针
//	printf("%s\n", *pa);
//	return 0;
//}
//实际解释
//int main() {
//	char* a[] = { "work","at","alibaba" };
//	char** pa = a;
//	pa+=2;
//	printf("%s\n", *pa);
//	return 0;
//}
// ///////////////////////////////////////////////
//例题八
int main() {
	char *c[] = {"ENTER","NUW","POINT","FIRST"};
	//c 指针数组,存放 指针变量
	//c[0/1/2] 存放各字符串的首个字符的地址
	char** cp[] = { c + 3,c + 2,c + 1,c};
	//cp 二级指针数组,存放 二级指针变量
	//cp[0] -> c+1 == c[0]+1 -> "NUW"
	//cp[1] -> c+2 == c[0]+2 -> "POINT"
	//cp[2] -> c+3 == c[0]+3 -> "FIRST"
	char*** cpp = cp;
	//cpp 三级指针变量 存放二级指针变量 cp 的地址
	// 即 cp[0] 的地址
	//cpp运算,相当于cp[0]+-
	// 
	printf("%s\n",**++cpp);
	//cpp自增,即cpp指向的cp[0]+1,此时cpp指向cp[1]
	//*cpp取出cpp指向的二级指针变量cp[1]
	//*cp[1]取出cp[1]指向的一级指针变量(c+2)
	//打印c+2指向的地址
	//"POINT"
	printf("%s\n", *-- * ++cpp + 3);
	//此时cpp指向cp[1]
	// ++cpp,即指向cp[2]
	// * ++cpp ,即取出cp[2]
	// --* ++cpp , 即cp[2]指向的(c+1)-1,此时cp[2]指向c
	//
	// char** cp[] = { c + 3,c + 2,c,c };
	// 
	//*--* ++cpp , 即 取出cp[2]指向的c
	// c+3 , 即 "ENTER" 的"E"开始打印
	// "ER"
	printf("%s\n", *cpp[-2] + 3);
	//此时cpp指向cp[2]
	// cpp[-2]即*(cpp-2),即 *cp[0],即 取出 c+3
	// *(c+3) 即 取出 "FIRST" 中 "F"的地址
	// +3 即 取出"FIRST"中"S"的地址
	// "ST"
	printf("%s\n", cpp[-1][-1] + 1);
	// 此时cpp指向cp[2],cp[2]指向c
	// cpp[-1],即*(cpp-1),即取出cp[1]
	// 此时cp[1]指向(c+2)
	// cp[1][-1] 即*(cp[1] -1) 
	// 此时cp[1]-1指向(c+1)
	// *(c+1)即取出"NUW"中"N"的地址
	// +1即取出"NUW"中"U"的地址
	// "UW"
	return 0;
}